Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །ལག་ན་རྡོ་རྗེ་རིའི་རྒྱལ་པོ་རི་རབ་ནི་རྡུལ་ཕྲ་རབ་ཏུ་གཏོར་བའི་གྲངས་ཀྱིས་མཐར་ཐུག་པར་བྱ་བར་ནུས་ཤིང་།
en: It is possible, Vajrapāṇi, to count the specks of dust that cover Mount Sumeru, the king of mountains, down to the last one.

source: སླར་ཡང་རིའི་རྒྱལ་པོ་རི་རབ་ཏུ་གནས་པར་འདོད་པས་རང་གི་གནས་སུ་རབ་ཏུ་བཞག་པར་ནུས་ཀྱི་དོན་ཡོད་ཞགས་པའི་སྙིང་པོའི་ཆོ་ག་ཞིབ་མོའི་ཚད་ནི་གཟུང་བར་མི་ནུས་སོ།
en: It is possible to stand on top of Mount Sumeru, the king of mountains, and to establish oneself there if that is one’s wish.

source: །དེ་ལྟར་རྒྱ་ཆེ་བ། དེ་ལྟར་གཏིང་དཔག་དཀའ་བ། དེ་ལྟར་ཟབ་པ་སྟེ།
en: But it is impossible to grasp the extent of the rituals that originate from the heart essence of Amoghapāśa: they are vast, difficult to fathom, and deep.

source: ལག་ན་རྡོ་རྗེ། འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཐུགས་ཀྱིས་མཁྱེན་པ་དང་། གཏིང་དཔག་པར་མི་ནུས་སོ། །དོན་ཡོད་ཞགས་པའི་སྙིང་པོའི་ཆོ་ག་ཞིབ་མོའི་ཆེད་འཛིན་པར་ནི་མི་ནུས་སོ།
en: It is impossible, Vajrapāṇi, to fathom the thoughts and knowledge of any of the past, present, and future tathāgatas, nor is it possible to grasp the extent of the rituals that originate from the heart essence of Amoghapāśa.

source: །ལག་ན་རྡོ་རྗེ་སྒྱུ་མ་ལྟ་བུ་གང་ཡིན་པ་དེ་དང་། སྙིང་པོ་དང་།
en: That heart essence, Vajrapāṇi, is illusion-like.

source: ཏིང་ངེ་འཛིན་གང་ཡིན་པ་དེ་དང་། ཞགས་པ་དང་།
en: That which is samādhi is the noose. “

source: སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་འཕྲུལ་པ་འདི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་སེམས་ཅན་རྣམས་ཀྱི་གཟུགས་དང་། ཁ་དོག་དང་། དབྱིབས་སྣ་ཚོགས་པ་དང་། ཚུལ་སྣ་ཚོགས་སུ་མཐོང་བར་བྱེད་དེ།
en: Magically creating things through the illusion-like samādhi, the bodhisattva Avalokiteśvara, the great being, appears to beings in all possible forms, taking a variety of shapes, colors, characteristics, and configurations.

source: སེམས་ཅན་ཐམས་ཅད་བསྒྲལ་བའི་ཆེད་དང་། རིག་སྔགས་འཆང་ཐམས་ཅད་ཀྱི་དངོས་གྲུབ་ཀྱི་མཆོག་སྒྲུབ་པར་བྱེད་པའོ། །ལག་ན་རྡོ་རྗེ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཐམས་ཅད་དུ་མཉམ་པར་འགྲོ་བ་སྟེ།
en: He does this to rescue all sentient beings and to bestow the supreme accomplishment upon all vidyā holders.

source: གང་དུ་ཆུ་དང་འོ་མ་མཉམ་པས་མཉམ་པ་བཞིན་ནོ། །ཐམས་ཅད་དུ་མཉམ་པས་བྱམས་པ་དང་སྙིང་རྗེ་ཆེན་པོ་རྒྱས་པར་བྱེད་དོ།
en: He permeates everything, blending as water blends with milk, and spreads his great love and compassion impartially.

source: །དོན་ཡོད་པའི་ཞགས་པས་འགུགས་པར་བྱེད་ལ་སྒྲོལ་བར་བྱེད་དོ།
en: He pulls beings in with his noose and rescues them from the ocean of suffering.

source: །འཆི་བ་མེད་པའི་ཐད་རྡོ་རྗེའི་དཀྱིལ་འཁོར་དུ་འཇོག་པར་བྱེད་དོ། །དམན་པ་དང་། མཆོག་དང་། བར་མ་དང་། རིགས་མཐོན་པོ་དང་།
en: He establishes them in the vajra maṇḍala, the dry land of the immortals.

source: དམའ་བ་དང་། དམྱལ་བ་དང་། བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་ལ་སོགས་པ་རྣམས་ཐམས་ཅད་དུ་མཉམ་པར་དྲན་པར་བྱེད་ཅིང་མིང་སྨོས་པ་ཙམ་གྱིས་འཛིན་པར་བྱེད་ཅིང་། སེམས་ཅན་ཐམས་ཅད་བླ་ན་མེད་པར་བྱེད་ལ་དུབ་པ་དང་།
en: As soon as they recollect him and say his name, he runs to and impartially saves all beings everywhere, regardless of whether they are of low, high, or medium position, of low or high birth, or whether they are hell beings, animals, denizens of the world of Yama, or any other type of being. “

source: ངལ་བ་དང་། ཡིད་ལ་གཅགས་པར་འགྱུར་བ་མེད་དོ། །ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་།
en: He never gets tired, weary, or discouraged.

source: ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་དང་། བརྗེད་བྱེད་དང་།
en: He visits the abodes of devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, rākṣasas, bhūtas, apasmāras, and pretas, as well as the realms of Yama and down to the subterranean paradises.

source: ཡི་དགས་དང་། ནགས་དང་། གཤིན་རྗེའི་གནས་ཇི་སྲིད་དུ་ས་འོག་གི་ནང་དུ་སོན་པ་རྣམས་དང་། སྲིད་པའི་རྩེ་མོ་ནས་མནར་མེད་པའི་མཐར་ཐུག་པ་དང་།
en: He travels as far as the peak of saṃsāric existence and the farthest reaches of the Avīci hell.

source: ཇི་སྲིད་དུ་འོག་མིན་གྱི་སྲིད་པའི་བར་དུ་གཅིག་ཏུ་སེམས་བསྐྱེད་པས་ཡོངས་སུ་རྒྱུག་གོ། །ལྷ་དང་། ཀླུ་དང་བཅས་པ་ནས་ཇི་སྲིད་དུད་འགྲོའི་སྐྱེ་གནས་ཀྱི་བར་ཐམས་ཅད་དང་། བུད་མེད་དང་། སྐྱེས་པ་དང་།
en: With his mind focused one-pointedly, he circles as far as the realm of Akaniṣṭha and saves all devas, nāgas, and so forth, down to the animals—female and male, young and old.

source: ཁྱེའུ་དང་། བུ་མོ་རྣམས་བླ་ན་མེད་པར་བྱེད་དོ། །དཔེར་ན་ཉི་མའི་འོད་ཟེར་ནི་མུན་པས་མདོངས་པ་ཐམས་ཅད་སེལ་བར་བྱེད་དེ།
en: Like the sun with its rays, he completely dispels the darkness of ignorance.

source: འཛམ་བུའི་གླིང་ཐམས་ཅད་དུ་མཉམ་པར་སྣང་བར་བྱེད་དོ།
en: He illuminates every part of Jambudvīpa equally.

source: །དེ་བཞིན་ཉིད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཐམས་ཅད་དུ་སྙིང་རྗེ་ཆེན་པོས་ཀུན་དུ་སྣང་བར་བྱེད་ཅིང་ཐམས་ཅད་ལ་ཐམས་ཅད་དུ་མཉམ་པར་གནས་ཏེ།
en: In this manner, the noble bodhisattva Avalokiteśvara, the great being, illuminates all places out of his great compassion.

source: སྡུག་བསྔལ་གྱི་ཚོར་བ་དང་། འཇིགས་པ་མི་བཟད་པ་དང་། ནད་དང་། མྱ་ངན་དང་། སྡུག་བསྔལ་གྱི་འཆི་བ་རྣམས་ཐམས་ཅད་ཡོངས་སུ་གྲོལ་བར་བྱེད་དོ།
en: He is equally present everywhere, and he liberates from all suffering, including physical pain, fear, terror, disease, grief, and bondage.

source: །སྐྱེ་བ་དང་། རྒ་བ་དང་། འཆི་བའི་སྡུག་བསྔལ་ཡོངས་སུ་གྲོལ་བར་བྱེད་དོ། །མཐོ་རིས་ལ་གཞོལ་བ་ལ་སོགས་པའི་ལམ་ཐམས་ཅད་དུ་འགོད་པར་བྱེད་དོ།
en: He liberates beings from the suffering of birth, old age, and death and establishes them on the path that invariably leads to all the different paradises and so forth. “

source: །དེ་ལྟར་ན་སྙིང་རྗེ་ཆེན་པོ་དང་། བྱམས་པ་ཆེན་པོས་ཐམས་ཅད་དུ་མཉམ་པར་རྗེས་སུ་འགྲོ་སྟེ། ཐམས་ཅད་དུ་མཉམ་པར་མཆོག་ཏུ་བྱེད་ཅིང་།
en: In this way, filled with great compassion and love, the bodhisattva Avalokiteśvara travels everywhere without distinction and impartially saves all beings.

source: ཐམས་ཅད་དུ་མཉམ་པར་བྱང་ཆུབ་ཀྱི་ལམ་ལ་རབ་ཏུ་འགོད་པར་བྱེད་དོ།
en: In all places he impartially establishes them on the path to awakening.

source: །ཐམས་ཅད་དུ་མཉམ་པར་སྐྱབས་དང་། དཔུང་གཉེན་དུ་འགྱུར་རོ།
en: He provides refuge to all these beings with the same dedication.

source: །ལག་ན་རྡོ་རྗེ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ནི། བརྟན་པ་དང་། གོ་ཆ་དང་། སྤྲོ་བ་ཆེན་པོས་རིག་སྔགས་འཆང་ཐམས་ཅད་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་གྱི་ཆེད་དུ་ཞུགས་པའོ།
en: In this way, Vajrapāṇi, the bodhisattva Avalokiteśvara, the great being, with his great steadfastness, fortitude, and perseverance, works for the benefit of all practitioners and all beings.

source: །ལག་ན་རྡོ་རྗེ་འདི་ནི་ཐབས་ཅིག་ཏུ་འཇུག་པ་ཆེན་པོ་སྟེ། སེམས་ཅན་ཐམས་ཅད་འཇིགས་པ་ཆེན་པོའི་ལམ་ལས་སོ་སོར་ལྡོག་པར་བྱེད་པའོ། །བདེ་བ་ནས་བདེ་བར་གཤེགས་པའི་ལམ་དུ་འགོད་པར་བྱེད་པའོ།
en: As the great guide of beings, he leads them away from the path of great terror and establishes them on the auspicious path of well-being and happiness.

source: །རྟོག་པ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་ལ་བསམ་པ་རྣམ་པ་གཞན་དུ་འགྱུར་བ་མེད་དོ། །སེམས་ཀྱིས་ཡིད་ལ་གཅགས་པར་འགྱུར་བ་མེད་དོ།
en: He does not harbor any concepts or doubts, never experiences a change of heart, and never regrets anything.”

source: །དེ་ནས་ཡང་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཕྱག་ན་རྡོ་རྗེས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཡོན་ཏན་བསྔགས་པ་ཆེན་པོ་འདི་ཐོས་ནས་དགའ་བ་དང་། མགུ་བ་དང་། ཡི་རངས་པ་དང་། རབ་ཏུ་རངས་པ་དང་། དགའ་བ་དང་།
en: Vajrapāṇi, the great yakṣa general, heard this account of the great qualities of Noble Avalokiteśvara, the great bodhisattva being, from the Blessed One and became elated with joy and happiness.

source: ཡིད་བདེ་བ་སྐྱེས་ནས་ཆེད་དུ་བརྗོད་པ་ནི་ཆེད་དུ་བརྗོད་པར་གྱུར་ཏོ། །ཨེ་མ་མགོན་པོ་འཇིག་རྟེན་དབང་ཕྱུག །
en: Expressing his joy and contentment, he said to [Noble Avalokiteśvara], “Wonderful, lokeśvara-protector!

source: ཨེ་མ་འཇིག་རྟེན་དབང་ཕྱུག་བླ་མ།
en: Wonderful, lokeśvara-teacher!

source: །ཁྱོད་ཀྱི་མིང་གི་ཡོན་ཏན་བསྐྱེད་པས། །ངན་འགྲོ་ཐམས་ཅད་གྲོལ་བར་བྱེད་དོ།
en: May all beings escape unhappy destinies through this proclamation of your qualities!”

source: །ཕྱག་ན་རྡོ་རྗེས་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྨྲས་པ། འདི་ནི་འཇིག་རྟེན་གྱི་བླ་མ་མགོན་པོ།
en: He further described the bodhisattva Avalokiteśvara: “He is the teacher of the world!

source: འདི་ནི་འཇིག་རྟེན་གྱི་ཡབ་ཆེན་པོ།
en: Here is the grandfather of the world!

source: འདི་ནི་འཇིག་རྟེན་སྒྲོལ་བར་བྱེད་པའི་མགོན་པོ།
en: He is the lord who ferries beings beyond this world!

source: ཐུབ་པ་ཉིན་མོའི་ཉི་མའོ།
en: O Sage, you are like the daytime sun!”

source: །བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །དེ་ལྟ་བུར་ལག་ན་རྡོ་རྗེ་ཇི་ལྟར་སྨྲ་བར་བགྱིད། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed Śākyamuni said, “It is as you say, Vajrapāṇi.

source: ལག་ན་རྡོ་རྗེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཅན་སོང་ལ། མངོན་པར་ཕྱག་འཚལ་ནས་ཡོངས་སུ་ཞུས་ཤིག །མཆོག་ཏུ་གྱུར་པའི་ཚིག་གིས་ཆོ་ག་ཇི་ལྟ་བ་བཞིན་དུ་སྙིང་པོ་དང་།
en: Now go, Vajrapāṇi, and address your questions, so eloquently phrased, to the bodhisattva Avalokiteśvara, the great being worthy of praise!

source: དེ་ཁོ་ན་ཉིད་ཀྱི་རང་བཞིན་དེ་རྣམས་སྟོན་པར་བྱེད་དོ།
en: He will explain the true nature and the core reality of things as they really are.

source: །དོན་ཡོད་ཞགས་པའི་སྙིང་པོའི་ཆོ་ག་ཞིབ་མོ་སྒྲུབ་པའི་དངོས་གྲུབ་ཇི་ལྟ་བ་བཞིན་དུ་སྟོན་པར་འགྱུར་ཞིང་ལུང་འབོགས་པར་བྱེད་དོ། །དེ་ནས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེས་ཟབ་མོ་ཟབ་པ་རྟོགས་ཤིང་ཁོང་དུ་ཆུད་དེ་སེང་གེའི་རྩལ་གྱིས་འགྲོ་ཞིང་།
en: He will show you how to accomplish the practices taught in the manual of rites of Amoghapāśa. He will give you the instructions.”

source: རྡོ་རྗེ་བསྐོར་བར་བྱེད་བཞིན་པས་ཟླ་བ་མཛེས་པ་དྲི་མ་མེད་པའི་མེ་ཏོག་བཟུང་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ག་ལ་བ་དེར་དོང་སྟེ་ལྷགས་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས། ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ། ཟླ་བ་མཛེས་པ་དྲི་མ་མེད་པའི་མེ་ཏོག་ཕུལ་ཏེ།
en: Vajrapāṇi, the great yakṣa general who follows the most profound conduct with the courage of a lion, took some immaculate flowers that were as bright as the moon, brandished his vajra, moved close to Noble Avalokiteśvara, the great bodhisattva being, bowed his head at the feet of Noble Avalokiteśvara, the great bodhisattva being, circumambulated him three times, and offered him the immaculate flowers that were as bright as the moon.

source: པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Then, kneeling on his right knee, he addressed Noble Avalokiteśvara, the great bodhisattva being, as follows: “Lord!

source: །བཅོམ་ལྡན་འདས་བདག་ནི་ཤིན་ཏུ་རྨོངས་པ་དང་ལྡན་པ་དྲན་པ་ཡོངས་སུ་ཉམས་པ་བློའི་དཔའ་ཞུམ་པ་སྟེ།
en: I am steeped in ignorance. My mind wanders and my intellect is limited.

source: དོན་ཡོད་ཞགས་པའི་སྙིང་པོའི་གསང་སྔགས་དང་ཕྱག་རྒྱ་མང་པོ་དང་།
en: This heart essence of Amoghapāśa, however, is very vast. There are many mantras and mudrās in it, along with practice procedures that involve a painting.

source: རས་རིས་ཀྱི་སྒྲུབ་པའི་ཆོ་ག་ཤིན་ཏུ་རྒྱས་པ་འདི་དང་དེ་དག་མི་ཤེས་སོ། །སྔོན་མ་ནི་དུ་ཞིག །བར་མ་ནི་དུ་ཞིག །ཐ་མ་ནི་དུ་ཞིག །རྩ་བའི་གསང་སྔགས་ནི་དུ་ཞིག །
en: I do not know which mantra I should use at the beginning, which mantra in the middle, and which mantra at the end.

source: སྙིང་པོ་ནི་དུ་ཞིག །ཉེ་བའི་སྙིང་པོ་ནི་དུ་ཞིག །ཇི་སྲིད་དུ་ཡི་གེ་བཅུ་པའི་བར་གྱི་གསང་སྔགས་ནི་དུ་ཞིག །
en: I do not know which mantra is the root mantra, which is the heart mantra, which is the auxiliary heart mantra, and so forth up to and including the ten-syllable mantra.

source: དཀྱིལ་འཁོར་དང་། ཆོ་ག་ཞིབ་མོ་དང་། རས་རིས་ནི་དུ་ཞིག་ལགས།
en: I do not know how the maṇḍala is to be constructed and how the painting is to be drawn.

source: བཅོམ་ལྡན་འདས་བདག་ལ་སྐབས་དབྱེ་བར་གསོལ་ཞེས་སོ།
en: Please, Lord, elucidate these things!”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་ཕྱག་ན་རྡོ་རྗེ་ལ་བརྩེ་བའི་དོན་དུ་ཟླ་བ་མཛེས་པ་དྲི་མ་མེད་པའི་མེ་ཏོག་བླངས་ནས། བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་དོན་དུ་ནམ་མཁའི་དབྱིངས་སུ་གཏོར་རོ།
en: Noble Avalokiteśvara, the great bodhisattva being, feeling compassion for Vajrapāṇi, took from him the immaculate flowers that were as bright as the moon and threw them into the sky as an offering for the Blessed One.

source: །གཏོར་མ་ཐག་ཏུ་བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་སྟེང་གི་མཚམས་སུ་འཁོར་ལོའི་རྣམ་པར་གནས་སོ།
en: As soon as he threw them, they formed the shape of a wheel above the Blessed One’s fontanelle.

source: །དཔག་ཚད་ལྔ་བརྒྱར་ཁྱབ་ཅིང་ས་གཞི་ལས་གྱེན་དུ་འཕགས་པ་ཉིད་ཀྱི་ཇི་སྲིད་འོག་མིན་གྱི་གནས་ཀྱི་བར་དུ་གནས་ཏེ།
en: The wheel rose high above the earth, its diameter expanding to five hundred leagues and reaching as far up as the Akaniṣṭha heaven.

source: བཻ་ཌཱུརྱ་སྔོན་པོ་ཆེན་པོའི་སྡོང་བུ་ལ་འཛམ་བུ་ཆུ་བོའི་གསེར་གྱི་དྲིལ་བུ་དཔྱངས་པའི་བ་དན་བཅིངས་པས་མཛེས་ཤིང་འབར་བར་ཡོངས་སུ་གྱུར་ཏོ།
en: It had a supporting pillar made of blue beryl, was hung with bells made with gold from the Jambu river, and had silk streamers attached underneath.

source: །འཁོར་ལོའི་རྣམ་པ་ལེགས་པར་ཡོངས་སུ་འཁོར་བ་ནི་ཉི་མ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་པས་ལྷག་པའི་ཀུན་ཏུ་སྣང་བ་ལེགས་པར་ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བ་ཤིན་ཏུ་དྲི་མ་མེད་པའི་གསེར་གྱི་མཆོད་སྡོང་རྣམ་པར་མཛེས་པར་ཤིན་ཏུ་གནས་པ།
en: Its circular shape, well formed and perfectly round, was blazing with light. The light was brighter than one hundred thousand million suns; it was exceedingly pure, pristine, and immaculate.

source: ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོ་སྣ་ཚོགས་པས་སྤྲས་པ་དགའ་བར་བྱ་བ།
en: The wheel, supported by golden posts, sparkled with many inlaid jewels of various kinds.

source: ཡིད་ཀྱི་ཤིང་རྟ་རབ་ཏུ་ཚིམ་པར་བྱེད་པ་དང་།
en: Charming and beautiful, it was refreshing and pleasant to look at.

source: དགའ་བར་བྱ་བ་མཐོང་བ་ལྷ་དང་། ལྷ་མ་ཡིན་གྱིས་ཕྱག་བྱ་བར་འོས་པ་དང་། རྗེད་པར་བྱ་བར་འོས་པ་དང་། དྲང་སྲོང་རྣམས་ཀྱིས་བསྟོད་པར་འོས་པ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ལུང་བསྟན་པར་འོས་པ་སྟེ།
en: It was honored and worshiped by devas and asuras, was praised by ṛṣis, and had been prophesied by the blessed buddhas.

source: ཐམས་ཅད་དུ་ཟླ་བ་མཛེས་པ་དྲི་མ་མེད་པའི་མེ་ཏོག་གི་གེ་སེར་ལ། དེ་བཞིན་གཤེགས་པའི་སྐུ་བཞུགས་པའི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཁང་པ་བརྩེགས་པ་འཁོར་གྱི་དཀྱིལ་འཁོར་གྱིས་ཡོངས་སུ་བསྐོར་ནས་བཞུགས་པ་ལ། གདུགས་ཀུན་ནས་ཡོངས་སུ་འཁོར་བའི་ལྷ་རྫས་ཀྱི་གཞལ་མེད་ཁང་དང་། ལྷ་དང་། ཀླུ་དང་། ཆུས་བྱུང་དང་།
en: On each of the anthers of the immaculate flowers that were as bright as the moon, a tathāgata sat inside a temple palace made of the seven types of jewels.

source: ལྷའི་བུ་མོ་དང་། ཀླུའི་བུ་མོ་དང་། མིའམ་ཅིའི་བུ་མོ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་།
en: All along the rim of the parasol were devas, nāgas, apsarases, celestial girls, young nāginīs and kinnarīs, and hundreds of thousands of devas, nāgas, yakṣas, gandharvas, asuras, kinnaras, mahoragas, and vidyādharas, each sitting in a celestial chariot.

source: རིག་སྔགས་འཆང་དང་། རིག་པ་འཛིན་པ་བརྒྱ་སྟོང་ཕྲག་གིས་ལྷ་རྫས་ཀྱི་མེ་ཏོག་སྣ་ཚོགས་པའི་གཞལ་མེད་ཁང་དང་། ལྷ་རྫས་ཀྱི་རྒྱན་དང་། གོས་དང་། ལྷབ་ལྷུབ་ཀྱིས་བརྒྱན་ཅིང་། དར་དཔྱངས་དང་། བ་དན་དང་། དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། ཆོས་གོས་དང་།
en: Sitting in their palaces made of various divine flowers, the vidyādharīs, adorned with divine ornaments and wearing divine clothes, held adornments, silk banners, fragrances, garlands, scented oils, scented powders, garments, parasols, banners, and flags.

source: གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམས་ཐོགས་ཏེ། བཅོམ་ལྡན་འདས་དང་འཁོར་གྱི་དཀྱིལ་འཁོར་ལ་མཆོད་པ་བྱེད་པར་གྱུར་ཏེ། ལྷ་རྫས་སྣ་ཚོགས་པའི་མཆོད་པའི་སྤྲིན་གྱི་ཆར་འབབ་པར་གྱུར་ཅིང་ལྷའི་དྲི་ཟའི་གླུ་དབྱངས་ཡང་དག་པར་ལེན་ཅིང་།
en: They made offerings to the Blessed One and his assembly, raining down clouds of various divine offerings.

source: རྔ་དང་། ཕེག་རྡོབ་རྣམས་ཀྱིས་མཆོད་པའི་དོན་དུ་རོལ་མོ་བྱེད་པར་གྱུར་ཏོ།
en: They sang the divine songs of gandharvas and played musical instruments and drums in offering to him.

source: །པོ་ཊ་ལའི་རི་བོར་གཞལ་མེད་ཁང་འཁོར་གྱི་དཀྱིལ་འཁོར་དང་བཅས་པ་རུ། ཅ་ཅོའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པར་གྱུར་ཏོ། །པོ་ཊ་ལ་ཀར་གནས་པའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་གང་ཡིན་པ་རྣམས་ཀྱང་སེམས་ཚིམ་པ་ཐོབ་ཅིང་། རྨད་དུ་བྱུང་བ་ཐོབ་བོ།
en: Loud cheering could be heard among the inhabitants of the palaces on Potala Mountain, as the devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas who lived there on Potala Mountain were stricken with wonder and beside themselves with joy.

source: །དེ་བཞིན་གཤེགས་པའི་རིགས་ཀྱི་དཀྱིལ་འཁོར་བའི་ལྷ་གང་ཡིན་པ་རྣམས་དང་། པདྨའི་རིགས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ལྷ་གང་ཡིན་པ་རྣམས་དང་། རྡོ་རྗེའི་རིགས་ཀྱི་དཀྱིལ་འཁོར་བའི་ལྷ་གང་ཡིན་པ་རྣམས་དང་། ནོར་བུའི་རིགས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ལྷ་གང་ཡིན་པ་རྣམས་དང་། གླང་པོའི་རིགས་ཀྱི་དཀྱིལ་འཁོར་བའི་ལྷ་གང་ཡིན་པ་རྣམས་དང་། དཀྱིལ་འཁོར་ཆེན་པོའི་ལྷ་གང་ཡིན་པ་དེ་རྣམས་ཐམས་ཅད་མཆོག་ཏུ་ཡ་མཚན་པ་དང་ལྡན་ཞིང་། རྨད་དུ་བྱུང་བ་ཐོབ་སྟེ།
en: So, too, were the maṇḍala deities of the tathāgata family, the maṇḍala deities of the lotus family, the maṇḍala deities of the vajra family, the maṇḍala deities of the jewel family, the maṇḍala deities of the elephant family, and other great maṇḍala deities.

source: སེམས་ཚིམ་པ་སྐྱེས་ལ་ངོ་མཚར་བ་ཐོབ་ནས། བཅོམ་ལྡན་འདས་ལ་ལྟ་བར་བྱེད་བཞིན་དུ་ཀུན་དུ་གནས་པར་གྱུར་ཏོ། །ཟླ་བ་དང་། ཉི་མ་དང་། རྒྱུ་སྐར་དང་། སྐར་མའི་ཚོགས་དང་། ལྷ་དང་། མཚན་མོའི་ལྷ་དང་། དབང་པོ་དང་། ཚངས་པ་དང་། ཁྱབ་འཇུག་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། གཞོན་ནུ་དང་། དགའ་བྱེད་དབང་ཕྱུག་དང་།
en: They were all totally amazed, wonder stricken, and beside themselves with joy, and they kept looking at the Blessed One in astonishment.

source: ཚོགས་ཀྱི་དབང་ཕྱུག་དང་། ནག་པོ་ཆེན་པོ་དང་། དབང་ཕྱུག་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་ཚངས་རིས་ཀྱི་ལྷའི་བུ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། ནོར་བུ་བཟང་པོ་དང་། གང་བ་བཟང་པོ་དང་། སྟོབས་ཀྱི་ལྷ་དང་། གཤིན་རྗེ་དང་། ཆུ་ལྷ་དང་། ལུས་ངན་གྱི་ལྷ་རྣམས་དང་། གཞོན་ནུའི་ལྷ་རྣམས་གདུགས་ཀྱི་ཡུབ་ནས་བཟུང་ནས།
en: Candra and Sūrya, the deities of the nakṣatras, the deities of the multitude of stars, the deities of the night, the divine sons including Śakra, Brahmā, Viṣṇu, Maheśvara, Kumāra, Nandikeśvara, Gaṇeśvara, Mahākāla, Īśvara, Maheśvara, and Brahmā, the Four Great Kings, and deities such as Maṇibhadra, Pūrṇabhadra, Baladeva, Yama, Varuṇa, Kubera, and Kumāra all supported the staff of the parasol together and worshiped the Blessed One with offerings.

source: བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱེད་པར་གྱུར་ཏོ། །ལྷའི་གཞལ་མེད་ཁང་ཆེན་པོ་ལྷའི་རྣམ་པར་སྤྲུལ་པའི་མཆོད་པའི་སྤྲིན་གྱིས་མཆོད་པ་བྱེད་དོ། །གདུགས་ཀྱི་རྣམ་པའི་ཁོར་ཡུག་གི་ནང་དུ་དགའ་ལྡན་གྱི་ལྷ་དང་། འོག་མིན་གྱི་ལྷ་དང་། ལྷའི་གནས་ཐམས་ཅད་དུ་ལྷའི་བུས་ཡོངས་སུ་བསྐོར་བ་གང་ཡིན་པ་དེ་ནམ་མཁའ་ལ་མཆོད་པའི་སྤྲིན་ཆེན་པོས་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དང་།
en: The gods from the realms of Tuṣita and Akaniṣṭha and the divine sons from every other celestial realm, together with their retinues, magically created great divine palaces and rained down clouds of offerings all around the parasol-shaped structure.

source: སྤྱན་རས་གཟིགས་ཀྱི་དབང་ཕྱུག་འཁོར་གྱི་དཀྱིལ་འཁོར་ལ་མཆོད་པ་བྱེད་དོ། །སའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། དྲི་ཟ་གང་ཡིན་པ་རྣམས་དང་། ས་གཞིའི་ལྷ་དང་། ཆུའི་ལྷ་དང་།
en: The assembled retinue of Avalokiteśvara also continued to worship the blessed Śākyamuni, filling the space with clouds of offerings.

source: ནགས་ཀྱི་ལྷ་དང་། ལོ་ཐོག་གི་ལྷ་དང་། སྨན་གྱི་ལྷ་གང་ཡིན་པ་དེ་རྣམས་ཐམས་ཅད་སའི་མཐིལ་གྱི་གཞལ་ཡས་ཁང་དེ་སྦྱོང་བར་བྱེད་པར་གྱུར་ཏེ། དྲི་སྣ་ཚོགས་པའི་ཆུས་ཆག་ཆག་འདེབས་ཤིང་། དྲི་སྣ་ཚོགས་པའི་ཕྱེ་མས་བྱུག་པར་བྱེད། མེ་ཏོག་སྣ་ཚོགས་གཅལ་དུ་འགྲེམས་ཤིང་།
en: All the deities of the earth, the nāgas, yakṣas, rākṣasas, and gandharvas, and the deities of the land and the waters, of the forests, and of the crops and herbs beautified the environment on earth, spraying it with various perfumes, sprinkling it with various scented powders, strewing it with various flowers, censing it with various types of incense, and adorning their respective places on earth.

source: བདུག་པ་སྣ་ཚོགས་ཀྱིས་བདུགས་ནས་སའི་དཀྱིལ་འཁོར་ཡང་དག་པར་བརྒྱན་པར་གྱུར་ཏོ། །དེ་ལྟར་རྣམ་པར་འཕྲུལ་པའི་གོ་སྐབས་རྒྱ་ཆེན་པོ་ནི་དེ་བཞིན་གཤེགས་པའི་ཁྱུ་མཆོག་དེ་བཞིན་གཤེགས་པའི་དམ་ཚིག་བྱིན་གྱིས་བརླབ་པའོ།
en: The entire vast space was thus magically transformed so that it partook in the majesty of the tathāgatas and received the blessing of their samaya.

source: །དེ་ནས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེས། དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པ་ཆེན་པོ་ཡངས་པ་རྒྱ་ཆེན་པོ་མཐོང་ནས། ཤིན་ཏུ་ཡ་མཚན་པ་ཐོབ་ཅིང་རྨད་དུ་བྱུང་བ་ཐོབ་སྟེ།
en: Vajrapāṇi, the great yakṣa general, seeing this enormous display of great magical power, was astounded.

source: འདི་ལྟར་སེམས་པར་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་བསྟན་པ་ནི་ཤིན་ཏུ་ཡ་མཚན་ནོ།
en: Stricken with wonder, he thought with great amazement, “All this is displayed by Noble Avalokiteśvara, the great bodhisattva being!”

source: །དེ་ནས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་སླར་ཡང་གསོལ་བ་བཏབ་བོ།
en: He once again requested Noble Avalokiteśvara, the great bodhisattva being, “Lord, please explain this.”

source: །བཅོམ་ལྡན་འདས་སྐབས་དབྱེ་བར་མཛོད་ཅིག་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལག་ན་རྡོ་རྗེ་དོགས་པ་བསལ་བ་དང་།
en: Noble Avalokiteśvara, the great bodhisattva being, replied to Vajrapāṇi, the great yakṣa general, “Here you are, Vajrapāṇi!

source: ཐེ་ཚོམ་གཅོད་པ་ལ་རྗེས་སུ་བཟུང་ངོ་།
en: I will now dispel your uncertainty and clear up your doubts.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་སྟན་ལས་ལངས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ།
en: He then got up from his seat, bowed to the Blessed One with folded hands, and circumambulated him clockwise three times.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འཁོད་ནས། མིག་མི་འཛུམས་ཤིང་བཞིན་རབ་ཏུ་འཛུམ་པ་ལུས་འོད་ཟེར་འབར་བས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ལ་དོན་ཡོད་ཞགས་པའི་དཀྱིལ་འཁོར་དང་། པདྨ་ཡངས་པའི་རྣམ་པར་འཕྲུལ་པ་དང་།
en: Standing in front of the Blessed One without blinking, with a smile on his face, his body radiating light, he said to the Blessed One, “I have, O lord, a maṇḍala of Amoghapāśa—a miraculous transformation arising within the lotus family.

source: པདྨ་གཙུག་ཏོར་གྱི་ནོར་བུའི་དཀྱིལ་འཁོར་དང་།
en: The maṇḍala of Padmoṣṇīṣamaṇi is the secret maṇḍala of Amoghapāśa.

source: དོན་ཡོད་ཞགས་པའི་གསང་བ་སྒྱུ་མ་ལྟ་བུའི་སྙིང་པོ་དང་ཕྱག་རྒྱ་དང་། ཀུན་དུ་སྤྱན་རས་གཟིགས་ཀྱི་དཀྱིལ་འཁོར་ཆེན་པོའི་རིམ་པར་ཕྱེ་བ་མཆིས་ཏེ།
en: It constitutes the seal of my illusion-like heart essence and belongs in the collection of great maṇḍalas of the all-seeing Avalokita.

source: བཅོམ་ལྡན་འདས་དེ་དག་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཡོངས་སུ་བསྒྲག་པར་བགྱིའོ།
en: In the presence of the Blessed One I will proclaim this easy practice that is accomplished through recitation and establishes genuine samaya.

source: །སྒྲུབ་པ་བླ་ཞིང་བཀླགས་པས་གྲུབ་པ་དམ་ཚིག་མཆོག་ཏུ་གྱུར་པའི་སྙིང་པོ་ཉེ་བར་བསྟན་པར་བགྱིའོ།
en: I will now teach this heart essence.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པས་ཕྱག་གསེར་གྱི་ཁ་དོག་ཅན། འོད་ཟེར་སྣ་ཚོགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་གིས་ཡང་དག་པར་བརྒྱན་པ་བརྐྱང་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྤྱི་བོའི་གཙུག་ཏུ་ཕྱག་འཇོག་པར་མཛད་ཅིང་སེམས་ཅན་དག་པ་ཆེན་པོ་ལེགས་སོ་ལེགས་སོ།
en: The blessed Tathāgata Śākyamuni extended his golden arm adorned with one hundred thousand million billion rays of multicolored light, placed his hand on the head of Noble Avalokiteśvara, the great bodhisattva being, and said, “Good!

source: །སྤྱན་རས་གཟིགས་ཀྱི་དབང་ཕྱུག །
en: It is good, O pure, great being!

source: ད་ལྟ་དེའི་དུས་ལ་བབ་པར་ཤེས་ན་སྨྲོས་ཤིག །
en: Please teach, Avalokiteśvara, if you think that the time is right.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས། བཅོམ་ལྡན་འདས་ཀྱིས་བསྐུལ་བར་རིག་ནས་ཕྱོགས་བཅུར་ཀུན་དུ་བལྟས་ཏེ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་ཕྱག་བྱས་ནས།
en: Noble Avalokiteśvara, the great bodhisattva being, heeding the Blessed One’s request, looked in each of the ten directions and bowed to all the tathāgatas there.
